---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MassLevelData.StrUsage
source: html/1d863832-bf9b-a3b8-7444-92c32d25fee6.htm
---
# Autodesk.Revit.DB.Analysis.MassLevelData.StrUsage Property

A String which describes the usage or occupancy type of the level of the MassLevelData.

## Syntax (C#)
```csharp
public string StrUsage { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null